giphy_api/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "d@d.com"], ["password_digest", "$2a$10$Fz/uj6HeyMDKcgH0Kt7bj.SuuGTojAJH3diR3QejUzHM2DVZb1WH."], ["created_at", 2017-02-28 20:10:32 UTC], ["updated_at", 2017-02-28 20:10:32 UTC]]
---
  def create
    user = User.new(user_params)
    if user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "a@a.com"], ["LIMIT", 1]]
---
  def login
    user = User.find_by(email: params[:user][:email])